Tekla Open API Reference for Tekla Structures 2025
RebarProperties.NumberingSeries Property
 Gets or sets the numbering series of the reinforcement.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumberingSeries NumberingSeries { get; set; }
Public Property NumberingSeries As NumberingSeries
	Get
	Set
Property Value
Type: NumberingSeries
See Also
Reference
RebarProperties Class
Tekla.Structures.Model Namespace